# Запит введення двох чисел від користувача
a = float(input("Введіть число a: "))
b = float(input("Введіть число b: "))

# Обчислення суми квадратів чисел
sum_squares = a**2 + b**2

# Обчислення різниці квадратів чисел
diff_squares = a**2 - b**2

# Обчислення добутку квадратів чисел
prod_squares = a**2 * b**2

# Обчислення частки квадратів чисел
quot_squares = (a**2) / (b**2)

# Виведення результатів на екран
print("Сума квадратів чисел:", sum_squares)
print("Різниця квадратів чисел:", diff_squares)
print("Добуток квадратів чисел:", prod_squares)
print("Частка квадратів чисел:", quot_squares)
